OpenFOAM-5/chapter9/pitzDaily3D/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions



blockMesh
XiFoam > log 
# decomposePar
# mpirun -np 4 XiFoam -parallel > log 
# reconstructPar


