OpenFOAM-5/chapter9/pitzDaily3D/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;


LES
{
LESModel        dynamicKEqn;//oneEqEddy;

delta           cubeRootVol;//vanDriest;

turbulence      on;

printCoeffs     on;

dynamicKEqnCoeffs
{
        filter simple;
}

cubeRootVolCoeffs
{
    deltaCoeff      1;
}

}


// ************************************************************************* //
